grevaillot/svd_tools/headers/STM32F103xx/can.h
#pragma once 

/* --- CAN: Controller area network --------------------------------- */

/** @defgroup can_registers Controller area network Register
@{*/

/** CAN_CAN_MCR CAN_MCR **/
#define CAN_CAN_MCR			MMIO32(CAN_BASE + 0x00)
/** CAN_CAN_MSR CAN_MSR **/
#define CAN_CAN_MSR			MMIO32(CAN_BASE + 0x04)
/** CAN_CAN_TSR CAN_TSR **/
#define CAN_CAN_TSR			MMIO32(CAN_BASE + 0x08)
/** CAN_CAN_RF0R CAN_RF0R **/
#define CAN_CAN_RF0R			MMIO32(CAN_BASE + 0x0c)
/** CAN_CAN_RF1R CAN_RF1R **/
#define CAN_CAN_RF1R			MMIO32(CAN_BASE + 0x10)
/** CAN_CAN_IER CAN_IER **/
#define CAN_CAN_IER			MMIO32(CAN_BASE + 0x14)
/** CAN_CAN_ESR CAN_ESR **/
#define CAN_CAN_ESR			MMIO32(CAN_BASE + 0x18)
/** CAN_CAN_BTR CAN_BTR **/
#define CAN_CAN_BTR			MMIO32(CAN_BASE + 0x1c)
/** CAN_CAN_TI0R CAN_TI0R **/
#define CAN_CAN_TI0R			MMIO32(CAN_BASE + 0x180)
/** CAN_CAN_TDT0R CAN_TDT0R **/
#define CAN_CAN_TDT0R			MMIO32(CAN_BASE + 0x184)
/** CAN_CAN_TDL0R CAN_TDL0R **/
#define CAN_CAN_TDL0R			MMIO32(CAN_BASE + 0x188)
/** CAN_CAN_TDH0R CAN_TDH0R **/
#define CAN_CAN_TDH0R			MMIO32(CAN_BASE + 0x18c)
/** CAN_CAN_TI1R CAN_TI1R **/
#define CAN_CAN_TI1R			MMIO32(CAN_BASE + 0x190)
/** CAN_CAN_TDT1R CAN_TDT1R **/
#define CAN_CAN_TDT1R			MMIO32(CAN_BASE + 0x194)
/** CAN_CAN_TDL1R CAN_TDL1R **/
#define CAN_CAN_TDL1R			MMIO32(CAN_BASE + 0x198)
/** CAN_CAN_TDH1R CAN_TDH1R **/
#define CAN_CAN_TDH1R			MMIO32(CAN_BASE + 0x19c)
/** CAN_CAN_TI2R CAN_TI2R **/
#define CAN_CAN_TI2R			MMIO32(CAN_BASE + 0x1a0)
/** CAN_CAN_TDT2R CAN_TDT2R **/
#define CAN_CAN_TDT2R			MMIO32(CAN_BASE + 0x1a4)
/** CAN_CAN_TDL2R CAN_TDL2R **/
#define CAN_CAN_TDL2R			MMIO32(CAN_BASE + 0x1a8)
/** CAN_CAN_TDH2R CAN_TDH2R **/
#define CAN_CAN_TDH2R			MMIO32(CAN_BASE + 0x1ac)
/** CAN_CAN_RI0R CAN_RI0R **/
#define CAN_CAN_RI0R			MMIO32(CAN_BASE + 0x1b0)
/** CAN_CAN_RDT0R CAN_RDT0R **/
#define CAN_CAN_RDT0R			MMIO32(CAN_BASE + 0x1b4)
/** CAN_CAN_RDL0R CAN_RDL0R **/
#define CAN_CAN_RDL0R			MMIO32(CAN_BASE + 0x1b8)
/** CAN_CAN_RDH0R CAN_RDH0R **/
#define CAN_CAN_RDH0R			MMIO32(CAN_BASE + 0x1bc)
/** CAN_CAN_RI1R CAN_RI1R **/
#define CAN_CAN_RI1R			MMIO32(CAN_BASE + 0x1c0)
/** CAN_CAN_RDT1R CAN_RDT1R **/
#define CAN_CAN_RDT1R			MMIO32(CAN_BASE + 0x1c4)
/** CAN_CAN_RDL1R CAN_RDL1R **/
#define CAN_CAN_RDL1R			MMIO32(CAN_BASE + 0x1c8)
/** CAN_CAN_RDH1R CAN_RDH1R **/
#define CAN_CAN_RDH1R			MMIO32(CAN_BASE + 0x1cc)
/** CAN_CAN_FMR CAN_FMR **/
#define CAN_CAN_FMR			MMIO32(CAN_BASE + 0x200)
/** CAN_CAN_FM1R CAN_FM1R **/
#define CAN_CAN_FM1R			MMIO32(CAN_BASE + 0x204)
/** CAN_CAN_FS1R CAN_FS1R **/
#define CAN_CAN_FS1R			MMIO32(CAN_BASE + 0x20c)
/** CAN_CAN_FFA1R CAN_FFA1R **/
#define CAN_CAN_FFA1R			MMIO32(CAN_BASE + 0x214)
/** CAN_CAN_FA1R CAN_FA1R **/
#define CAN_CAN_FA1R			MMIO32(CAN_BASE + 0x21c)
/** CAN_F0R1 Filter bank 0 register 1 **/
#define CAN_F0R1			MMIO32(CAN_BASE + 0x240)
/** CAN_F0R2 Filter bank 0 register 2 **/
#define CAN_F0R2			MMIO32(CAN_BASE + 0x244)
/** CAN_F1R1 Filter bank 1 register 1 **/
#define CAN_F1R1			MMIO32(CAN_BASE + 0x248)
/** CAN_F1R2 Filter bank 1 register 2 **/
#define CAN_F1R2			MMIO32(CAN_BASE + 0x24c)
/** CAN_F2R1 Filter bank 2 register 1 **/
#define CAN_F2R1			MMIO32(CAN_BASE + 0x250)
/** CAN_F2R2 Filter bank 2 register 2 **/
#define CAN_F2R2			MMIO32(CAN_BASE + 0x254)
/** CAN_F3R1 Filter bank 3 register 1 **/
#define CAN_F3R1			MMIO32(CAN_BASE + 0x258)
/** CAN_F3R2 Filter bank 3 register 2 **/
#define CAN_F3R2			MMIO32(CAN_BASE + 0x25c)
/** CAN_F4R1 Filter bank 4 register 1 **/
#define CAN_F4R1			MMIO32(CAN_BASE + 0x260)
/** CAN_F4R2 Filter bank 4 register 2 **/
#define CAN_F4R2			MMIO32(CAN_BASE + 0x264)
/** CAN_F5R1 Filter bank 5 register 1 **/
#define CAN_F5R1			MMIO32(CAN_BASE + 0x268)
/** CAN_F5R2 Filter bank 5 register 2 **/
#define CAN_F5R2			MMIO32(CAN_BASE + 0x26c)
/** CAN_F6R1 Filter bank 6 register 1 **/
#define CAN_F6R1			MMIO32(CAN_BASE + 0x270)
/** CAN_F6R2 Filter bank 6 register 2 **/
#define CAN_F6R2			MMIO32(CAN_BASE + 0x274)
/** CAN_F7R1 Filter bank 7 register 1 **/
#define CAN_F7R1			MMIO32(CAN_BASE + 0x278)
/** CAN_F7R2 Filter bank 7 register 2 **/
#define CAN_F7R2			MMIO32(CAN_BASE + 0x27c)
/** CAN_F8R1 Filter bank 8 register 1 **/
#define CAN_F8R1			MMIO32(CAN_BASE + 0x280)
/** CAN_F8R2 Filter bank 8 register 2 **/
#define CAN_F8R2			MMIO32(CAN_BASE + 0x284)
/** CAN_F9R1 Filter bank 9 register 1 **/
#define CAN_F9R1			MMIO32(CAN_BASE + 0x288)
/** CAN_F9R2 Filter bank 9 register 2 **/
#define CAN_F9R2			MMIO32(CAN_BASE + 0x28c)
/** CAN_F10R1 Filter bank 10 register 1 **/
#define CAN_F10R1			MMIO32(CAN_BASE + 0x290)
/** CAN_F10R2 Filter bank 10 register 2 **/
#define CAN_F10R2			MMIO32(CAN_BASE + 0x294)
/** CAN_F11R1 Filter bank 11 register 1 **/
#define CAN_F11R1			MMIO32(CAN_BASE + 0x298)
/** CAN_F11R2 Filter bank 11 register 2 **/
#define CAN_F11R2			MMIO32(CAN_BASE + 0x29c)
/** CAN_F12R1 Filter bank 4 register 1 **/
#define CAN_F12R1			MMIO32(CAN_BASE + 0x2a0)
/** CAN_F12R2 Filter bank 12 register 2 **/
#define CAN_F12R2			MMIO32(CAN_BASE + 0x2a4)
/** CAN_F13R1 Filter bank 13 register 1 **/
#define CAN_F13R1			MMIO32(CAN_BASE + 0x2a8)
/** CAN_F13R2 Filter bank 13 register 2 **/
#define CAN_F13R2			MMIO32(CAN_BASE + 0x2ac)

/**@}*/


/** @defgroup can_can_mcr CANMCR CAN_MCR
@{*/

/** CAN_CAN_MCR_DBF DBF **/
#define CAN_CAN_MCR_DBF		(1 << 16)
/** CAN_CAN_MCR_RESET RESET **/
#define CAN_CAN_MCR_RESET		(1 << 15)
/** CAN_CAN_MCR_TTCM TTCM **/
#define CAN_CAN_MCR_TTCM		(1 << 7)
/** CAN_CAN_MCR_ABOM ABOM **/
#define CAN_CAN_MCR_ABOM		(1 << 6)
/** CAN_CAN_MCR_AWUM AWUM **/
#define CAN_CAN_MCR_AWUM		(1 << 5)
/** CAN_CAN_MCR_NART NART **/
#define CAN_CAN_MCR_NART		(1 << 4)
/** CAN_CAN_MCR_RFLM RFLM **/
#define CAN_CAN_MCR_RFLM		(1 << 3)
/** CAN_CAN_MCR_TXFP TXFP **/
#define CAN_CAN_MCR_TXFP		(1 << 2)
/** CAN_CAN_MCR_SLEEP SLEEP **/
#define CAN_CAN_MCR_SLEEP		(1 << 1)
/** CAN_CAN_MCR_INRQ INRQ **/
#define CAN_CAN_MCR_INRQ		(1 << 0)

/**@}*/

/** @defgroup can_can_msr CANMSR CAN_MSR
@{*/

/** CAN_CAN_MSR_RX RX **/
#define CAN_CAN_MSR_RX		(1 << 11)
/** CAN_CAN_MSR_SAMP SAMP **/
#define CAN_CAN_MSR_SAMP		(1 << 10)
/** CAN_CAN_MSR_RXM RXM **/
#define CAN_CAN_MSR_RXM		(1 << 9)
/** CAN_CAN_MSR_TXM TXM **/
#define CAN_CAN_MSR_TXM		(1 << 8)
/** CAN_CAN_MSR_SLAKI SLAKI **/
#define CAN_CAN_MSR_SLAKI		(1 << 4)
/** CAN_CAN_MSR_WKUI WKUI **/
#define CAN_CAN_MSR_WKUI		(1 << 3)
/** CAN_CAN_MSR_ERRI ERRI **/
#define CAN_CAN_MSR_ERRI		(1 << 2)
/** CAN_CAN_MSR_SLAK SLAK **/
#define CAN_CAN_MSR_SLAK		(1 << 1)
/** CAN_CAN_MSR_INAK INAK **/
#define CAN_CAN_MSR_INAK		(1 << 0)

/**@}*/

/** @defgroup can_can_tsr CANTSR CAN_TSR
@{*/

/** CAN_CAN_TSR_LOW2 Lowest priority flag for mailbox 2 **/
#define CAN_CAN_TSR_LOW2		(1 << 31)
/** CAN_CAN_TSR_LOW1 Lowest priority flag for mailbox 1 **/
#define CAN_CAN_TSR_LOW1		(1 << 30)
/** CAN_CAN_TSR_LOW0 Lowest priority flag for mailbox 0 **/
#define CAN_CAN_TSR_LOW0		(1 << 29)
/** CAN_CAN_TSR_TME2 Lowest priority flag for mailbox 2 **/
#define CAN_CAN_TSR_TME2		(1 << 28)
/** CAN_CAN_TSR_TME1 Lowest priority flag for mailbox 1 **/
#define CAN_CAN_TSR_TME1		(1 << 27)
/** CAN_CAN_TSR_TME0 Lowest priority flag for mailbox 0 **/
#define CAN_CAN_TSR_TME0		(1 << 26)

#define CAN_CAN_TSR_CODE_SHIFT		24
#define CAN_CAN_TSR_CODE_MASK		0x03
/** @defgroup can_can_tsr_code CODE CODE
@{*/
/**@}*/

