grevaillot/svd_tools/headers/STM32F103xx/can.h
/** CAN_CAN_RI1R_IDE IDE **/
#define CAN_CAN_RI1R_IDE		(1 << 2)
/** CAN_CAN_RI1R_RTR RTR **/
#define CAN_CAN_RI1R_RTR		(1 << 1)

/**@}*/

/** @defgroup can_can_rdt1r CANRDT1R CAN_RDT1R
@{*/


#define CAN_CAN_RDT1R_TIME_SHIFT		16
#define CAN_CAN_RDT1R_TIME_MASK		0xffff
/** @defgroup can_can_rdt1r_time TIME TIME
@{*/
/**@}*/


#define CAN_CAN_RDT1R_FMI_SHIFT		8
#define CAN_CAN_RDT1R_FMI_MASK		0xff
/** @defgroup can_can_rdt1r_fmi FMI FMI
@{*/
/**@}*/


#define CAN_CAN_RDT1R_DLC_SHIFT		0
#define CAN_CAN_RDT1R_DLC_MASK		0x0f
/** @defgroup can_can_rdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_rdl1r CANRDL1R CAN_RDL1R
@{*/


#define CAN_CAN_RDL1R_DATA3_SHIFT		24
#define CAN_CAN_RDL1R_DATA3_MASK		0xff
/** @defgroup can_can_rdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_CAN_RDL1R_DATA2_SHIFT		16
#define CAN_CAN_RDL1R_DATA2_MASK		0xff
/** @defgroup can_can_rdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_CAN_RDL1R_DATA1_SHIFT		8
#define CAN_CAN_RDL1R_DATA1_MASK		0xff
/** @defgroup can_can_rdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_CAN_RDL1R_DATA0_SHIFT		0
#define CAN_CAN_RDL1R_DATA0_MASK		0xff
/** @defgroup can_can_rdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_rdh1r CANRDH1R CAN_RDH1R
@{*/


#define CAN_CAN_RDH1R_DATA7_SHIFT		24
#define CAN_CAN_RDH1R_DATA7_MASK		0xff
/** @defgroup can_can_rdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_CAN_RDH1R_DATA6_SHIFT		16
#define CAN_CAN_RDH1R_DATA6_MASK		0xff
/** @defgroup can_can_rdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_CAN_RDH1R_DATA5_SHIFT		8
#define CAN_CAN_RDH1R_DATA5_MASK		0xff
/** @defgroup can_can_rdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_CAN_RDH1R_DATA4_SHIFT		0
#define CAN_CAN_RDH1R_DATA4_MASK		0xff
/** @defgroup can_can_rdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_fmr CANFMR CAN_FMR
@{*/

/** CAN_CAN_FMR_FINIT FINIT **/
#define CAN_CAN_FMR_FINIT		(1 << 0)

/**@}*/

/** @defgroup can_can_fm1r CANFM1R CAN_FM1R
@{*/

/** CAN_CAN_FM1R_FBM13 Filter mode **/
#define CAN_CAN_FM1R_FBM13		(1 << 13)
/** CAN_CAN_FM1R_FBM12 Filter mode **/
#define CAN_CAN_FM1R_FBM12		(1 << 12)
/** CAN_CAN_FM1R_FBM11 Filter mode **/
#define CAN_CAN_FM1R_FBM11		(1 << 11)
/** CAN_CAN_FM1R_FBM10 Filter mode **/
#define CAN_CAN_FM1R_FBM10		(1 << 10)
/** CAN_CAN_FM1R_FBM9 Filter mode **/
#define CAN_CAN_FM1R_FBM9		(1 << 9)
/** CAN_CAN_FM1R_FBM8 Filter mode **/
#define CAN_CAN_FM1R_FBM8		(1 << 8)
/** CAN_CAN_FM1R_FBM7 Filter mode **/
#define CAN_CAN_FM1R_FBM7		(1 << 7)
/** CAN_CAN_FM1R_FBM6 Filter mode **/
#define CAN_CAN_FM1R_FBM6		(1 << 6)
/** CAN_CAN_FM1R_FBM5 Filter mode **/
#define CAN_CAN_FM1R_FBM5		(1 << 5)
/** CAN_CAN_FM1R_FBM4 Filter mode **/
#define CAN_CAN_FM1R_FBM4		(1 << 4)
/** CAN_CAN_FM1R_FBM3 Filter mode **/
#define CAN_CAN_FM1R_FBM3		(1 << 3)
/** CAN_CAN_FM1R_FBM2 Filter mode **/
#define CAN_CAN_FM1R_FBM2		(1 << 2)
/** CAN_CAN_FM1R_FBM1 Filter mode **/
#define CAN_CAN_FM1R_FBM1		(1 << 1)
/** CAN_CAN_FM1R_FBM0 Filter mode **/
#define CAN_CAN_FM1R_FBM0		(1 << 0)

/**@}*/

/** @defgroup can_can_fs1r CANFS1R CAN_FS1R
@{*/

/** CAN_CAN_FS1R_FSC13 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC13		(1 << 13)
/** CAN_CAN_FS1R_FSC12 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC12		(1 << 12)
/** CAN_CAN_FS1R_FSC11 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC11		(1 << 11)
/** CAN_CAN_FS1R_FSC10 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC10		(1 << 10)
/** CAN_CAN_FS1R_FSC9 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC9		(1 << 9)
/** CAN_CAN_FS1R_FSC8 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC8		(1 << 8)
/** CAN_CAN_FS1R_FSC7 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC7		(1 << 7)
/** CAN_CAN_FS1R_FSC6 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC6		(1 << 6)
/** CAN_CAN_FS1R_FSC5 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC5		(1 << 5)
/** CAN_CAN_FS1R_FSC4 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC4		(1 << 4)
/** CAN_CAN_FS1R_FSC3 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC3		(1 << 3)
/** CAN_CAN_FS1R_FSC2 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC2		(1 << 2)
/** CAN_CAN_FS1R_FSC1 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC1		(1 << 1)
/** CAN_CAN_FS1R_FSC0 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC0		(1 << 0)

/**@}*/

/** @defgroup can_can_ffa1r CANFFA1R CAN_FFA1R
@{*/

/** CAN_CAN_FFA1R_FFA13 Filter FIFO assignment for filter 13 **/
#define CAN_CAN_FFA1R_FFA13		(1 << 13)
/** CAN_CAN_FFA1R_FFA12 Filter FIFO assignment for filter 12 **/
#define CAN_CAN_FFA1R_FFA12		(1 << 12)
/** CAN_CAN_FFA1R_FFA11 Filter FIFO assignment for filter 11 **/
#define CAN_CAN_FFA1R_FFA11		(1 << 11)
/** CAN_CAN_FFA1R_FFA10 Filter FIFO assignment for filter 10 **/
#define CAN_CAN_FFA1R_FFA10		(1 << 10)
/** CAN_CAN_FFA1R_FFA9 Filter FIFO assignment for filter 9 **/
#define CAN_CAN_FFA1R_FFA9		(1 << 9)
/** CAN_CAN_FFA1R_FFA8 Filter FIFO assignment for filter 8 **/
#define CAN_CAN_FFA1R_FFA8		(1 << 8)
/** CAN_CAN_FFA1R_FFA7 Filter FIFO assignment for filter 7 **/
#define CAN_CAN_FFA1R_FFA7		(1 << 7)
/** CAN_CAN_FFA1R_FFA6 Filter FIFO assignment for filter 6 **/
#define CAN_CAN_FFA1R_FFA6		(1 << 6)
/** CAN_CAN_FFA1R_FFA5 Filter FIFO assignment for filter 5 **/
#define CAN_CAN_FFA1R_FFA5		(1 << 5)
/** CAN_CAN_FFA1R_FFA4 Filter FIFO assignment for filter 4 **/
#define CAN_CAN_FFA1R_FFA4		(1 << 4)
/** CAN_CAN_FFA1R_FFA3 Filter FIFO assignment for filter 3 **/
#define CAN_CAN_FFA1R_FFA3		(1 << 3)
/** CAN_CAN_FFA1R_FFA2 Filter FIFO assignment for filter 2 **/
#define CAN_CAN_FFA1R_FFA2		(1 << 2)
/** CAN_CAN_FFA1R_FFA1 Filter FIFO assignment for filter 1 **/
#define CAN_CAN_FFA1R_FFA1		(1 << 1)
/** CAN_CAN_FFA1R_FFA0 Filter FIFO assignment for filter 0 **/
#define CAN_CAN_FFA1R_FFA0		(1 << 0)

/**@}*/

/** @defgroup can_can_fa1r CANFA1R CAN_FA1R
@{*/

/** CAN_CAN_FA1R_FACT13 Filter active **/
#define CAN_CAN_FA1R_FACT13		(1 << 13)
/** CAN_CAN_FA1R_FACT12 Filter active **/
#define CAN_CAN_FA1R_FACT12		(1 << 12)
/** CAN_CAN_FA1R_FACT11 Filter active **/
#define CAN_CAN_FA1R_FACT11		(1 << 11)
/** CAN_CAN_FA1R_FACT10 Filter active **/
#define CAN_CAN_FA1R_FACT10		(1 << 10)
/** CAN_CAN_FA1R_FACT9 Filter active **/
#define CAN_CAN_FA1R_FACT9		(1 << 9)
/** CAN_CAN_FA1R_FACT8 Filter active **/
#define CAN_CAN_FA1R_FACT8		(1 << 8)
/** CAN_CAN_FA1R_FACT7 Filter active **/
#define CAN_CAN_FA1R_FACT7		(1 << 7)
/** CAN_CAN_FA1R_FACT6 Filter active **/
#define CAN_CAN_FA1R_FACT6		(1 << 6)
/** CAN_CAN_FA1R_FACT5 Filter active **/
#define CAN_CAN_FA1R_FACT5		(1 << 5)
/** CAN_CAN_FA1R_FACT4 Filter active **/
#define CAN_CAN_FA1R_FACT4		(1 << 4)
/** CAN_CAN_FA1R_FACT3 Filter active **/
#define CAN_CAN_FA1R_FACT3		(1 << 3)
/** CAN_CAN_FA1R_FACT2 Filter active **/
#define CAN_CAN_FA1R_FACT2		(1 << 2)
/** CAN_CAN_FA1R_FACT1 Filter active **/
#define CAN_CAN_FA1R_FACT1		(1 << 1)
/** CAN_CAN_FA1R_FACT0 Filter active **/
#define CAN_CAN_FA1R_FACT0		(1 << 0)

/**@}*/

/** @defgroup can_f0r1 F0R1 Filter bank 0 register 1
@{*/

/** CAN_F0R1_FB31 Filter bits **/
#define CAN_F0R1_FB31		(1 << 31)
/** CAN_F0R1_FB30 Filter bits **/
#define CAN_F0R1_FB30		(1 << 30)
/** CAN_F0R1_FB29 Filter bits **/
#define CAN_F0R1_FB29		(1 << 29)
/** CAN_F0R1_FB28 Filter bits **/
#define CAN_F0R1_FB28		(1 << 28)
/** CAN_F0R1_FB27 Filter bits **/
#define CAN_F0R1_FB27		(1 << 27)
/** CAN_F0R1_FB26 Filter bits **/
#define CAN_F0R1_FB26		(1 << 26)
/** CAN_F0R1_FB25 Filter bits **/
#define CAN_F0R1_FB25		(1 << 25)
/** CAN_F0R1_FB24 Filter bits **/
#define CAN_F0R1_FB24		(1 << 24)
/** CAN_F0R1_FB23 Filter bits **/
#define CAN_F0R1_FB23		(1 << 23)
/** CAN_F0R1_FB22 Filter bits **/
#define CAN_F0R1_FB22		(1 << 22)
/** CAN_F0R1_FB21 Filter bits **/
#define CAN_F0R1_FB21		(1 << 21)
/** CAN_F0R1_FB20 Filter bits **/
#define CAN_F0R1_FB20		(1 << 20)
/** CAN_F0R1_FB19 Filter bits **/
#define CAN_F0R1_FB19		(1 << 19)
/** CAN_F0R1_FB18 Filter bits **/
#define CAN_F0R1_FB18		(1 << 18)
/** CAN_F0R1_FB17 Filter bits **/
#define CAN_F0R1_FB17		(1 << 17)
/** CAN_F0R1_FB16 Filter bits **/
#define CAN_F0R1_FB16		(1 << 16)
/** CAN_F0R1_FB15 Filter bits **/
#define CAN_F0R1_FB15		(1 << 15)
/** CAN_F0R1_FB14 Filter bits **/
#define CAN_F0R1_FB14		(1 << 14)
/** CAN_F0R1_FB13 Filter bits **/
#define CAN_F0R1_FB13		(1 << 13)
/** CAN_F0R1_FB12 Filter bits **/
#define CAN_F0R1_FB12		(1 << 12)
/** CAN_F0R1_FB11 Filter bits **/
#define CAN_F0R1_FB11		(1 << 11)
/** CAN_F0R1_FB10 Filter bits **/
#define CAN_F0R1_FB10		(1 << 10)
/** CAN_F0R1_FB9 Filter bits **/
#define CAN_F0R1_FB9		(1 << 9)
/** CAN_F0R1_FB8 Filter bits **/
#define CAN_F0R1_FB8		(1 << 8)
/** CAN_F0R1_FB7 Filter bits **/
#define CAN_F0R1_FB7		(1 << 7)
/** CAN_F0R1_FB6 Filter bits **/
#define CAN_F0R1_FB6		(1 << 6)
/** CAN_F0R1_FB5 Filter bits **/
#define CAN_F0R1_FB5		(1 << 5)
/** CAN_F0R1_FB4 Filter bits **/
#define CAN_F0R1_FB4		(1 << 4)
/** CAN_F0R1_FB3 Filter bits **/
#define CAN_F0R1_FB3		(1 << 3)
/** CAN_F0R1_FB2 Filter bits **/
#define CAN_F0R1_FB2		(1 << 2)
/** CAN_F0R1_FB1 Filter bits **/
#define CAN_F0R1_FB1		(1 << 1)
/** CAN_F0R1_FB0 Filter bits **/
#define CAN_F0R1_FB0		(1 << 0)

/**@}*/

/** @defgroup can_f0r2 F0R2 Filter bank 0 register 2
@{*/

/** CAN_F0R2_FB31 Filter bits **/
#define CAN_F0R2_FB31		(1 << 31)
/** CAN_F0R2_FB30 Filter bits **/
#define CAN_F0R2_FB30		(1 << 30)
/** CAN_F0R2_FB29 Filter bits **/
#define CAN_F0R2_FB29		(1 << 29)
/** CAN_F0R2_FB28 Filter bits **/
#define CAN_F0R2_FB28		(1 << 28)
/** CAN_F0R2_FB27 Filter bits **/
#define CAN_F0R2_FB27		(1 << 27)
/** CAN_F0R2_FB26 Filter bits **/
#define CAN_F0R2_FB26		(1 << 26)
/** CAN_F0R2_FB25 Filter bits **/
#define CAN_F0R2_FB25		(1 << 25)
/** CAN_F0R2_FB24 Filter bits **/
#define CAN_F0R2_FB24		(1 << 24)
/** CAN_F0R2_FB23 Filter bits **/
#define CAN_F0R2_FB23		(1 << 23)
/** CAN_F0R2_FB22 Filter bits **/
#define CAN_F0R2_FB22		(1 << 22)
/** CAN_F0R2_FB21 Filter bits **/
#define CAN_F0R2_FB21		(1 << 21)
/** CAN_F0R2_FB20 Filter bits **/
#define CAN_F0R2_FB20		(1 << 20)
/** CAN_F0R2_FB19 Filter bits **/
#define CAN_F0R2_FB19		(1 << 19)
/** CAN_F0R2_FB18 Filter bits **/
#define CAN_F0R2_FB18		(1 << 18)
/** CAN_F0R2_FB17 Filter bits **/
#define CAN_F0R2_FB17		(1 << 17)
/** CAN_F0R2_FB16 Filter bits **/
#define CAN_F0R2_FB16		(1 << 16)
/** CAN_F0R2_FB15 Filter bits **/
#define CAN_F0R2_FB15		(1 << 15)
/** CAN_F0R2_FB14 Filter bits **/
#define CAN_F0R2_FB14		(1 << 14)
/** CAN_F0R2_FB13 Filter bits **/
#define CAN_F0R2_FB13		(1 << 13)
/** CAN_F0R2_FB12 Filter bits **/
#define CAN_F0R2_FB12		(1 << 12)
/** CAN_F0R2_FB11 Filter bits **/
#define CAN_F0R2_FB11		(1 << 11)
/** CAN_F0R2_FB10 Filter bits **/
#define CAN_F0R2_FB10		(1 << 10)
/** CAN_F0R2_FB9 Filter bits **/
#define CAN_F0R2_FB9		(1 << 9)
/** CAN_F0R2_FB8 Filter bits **/
#define CAN_F0R2_FB8		(1 << 8)
/** CAN_F0R2_FB7 Filter bits **/
#define CAN_F0R2_FB7		(1 << 7)
/** CAN_F0R2_FB6 Filter bits **/
#define CAN_F0R2_FB6		(1 << 6)
/** CAN_F0R2_FB5 Filter bits **/
#define CAN_F0R2_FB5		(1 << 5)
/** CAN_F0R2_FB4 Filter bits **/
#define CAN_F0R2_FB4		(1 << 4)
/** CAN_F0R2_FB3 Filter bits **/
#define CAN_F0R2_FB3		(1 << 3)
/** CAN_F0R2_FB2 Filter bits **/
#define CAN_F0R2_FB2		(1 << 2)
/** CAN_F0R2_FB1 Filter bits **/
#define CAN_F0R2_FB1		(1 << 1)
/** CAN_F0R2_FB0 Filter bits **/
#define CAN_F0R2_FB0		(1 << 0)

/**@}*/

/** @defgroup can_f1r1 F1R1 Filter bank 1 register 1
@{*/

